In [38]:
import numpy as np
import pandas as pd

In [3]:
kor_score = [70, 79, 80, 90, 80] 
math_score = [42, 80, 30, 50, 90] 
eng_score = [53, 77, 50, 70, 55]

In [7]:
pd.DataFrame({'kor':kor_score, 'math':math_score,'eng':eng_score})
# (계산) 데이터 프레임을 활용하여 표로 만들어 놓기

   kor  math  eng
0   70    42   53
1   79    80   77
2   80    30   50
3   90    50   70
4   80    90   55

In [15]:
score_df=pd.DataFrame({'kor':kor_score, 'math':math_score,'eng':eng_score})

In [16]:
score_df

   kor  math  eng
0   70    42   53
1   79    80   77
2   80    30   50
3   90    50   70
4   80    90   55

In [ ]:
score_df.describe()
# 과목별 평균

             kor       math        eng
count   5.000000   5.000000   5.000000
mean   79.800000  58.400000  61.000000
std     7.085196  25.549951  11.811012
min    70.000000  30.000000  50.000000
25%    79.000000  42.000000  53.000000
50%    80.000000  50.000000  55.000000
75%    80.000000  80.000000  70.000000
max    90.000000  90.000000  77.000000

In [ ]:
score_df.T.describe()
# 학생별 평균

               0          1          2     3          4
count   3.000000   3.000000   3.000000   3.0   3.000000
mean   55.000000  78.666667  53.333333  70.0  75.000000
std    14.106736   1.527525  25.166115  20.0  18.027756
min    42.000000  77.000000  30.000000  50.0  55.000000
25%    47.500000  78.000000  40.000000  60.0  67.500000
50%    53.000000  79.000000  50.000000  70.0  80.000000
75%    61.500000  79.500000  65.000000  80.0  85.000000
max    70.000000  80.000000  80.000000  90.0  90.000000

In [ ]:
# 국영수 평균이 90 이상이면 A, 80이상이면 B, 70이상이면 C, 그외에는 D로 표시
# pd.select() 활용

In [21]:
stu_mean = score_df.T.describe()

In [23]:
stu_mean.index
# 데이터프레임에서 mean(평균)만 추출하기 위해 index 출력

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [26]:
stu_mean.loc['mean']
# 인덱스에서 불러올때는 위치를 알려주는 loc['인덱스명']

0    55.000000
1    78.666667
2    53.333333
3    70.000000
4    75.000000
Name: mean, dtype: float64

In [28]:
pd.DataFrame(stu_mean.loc['mean'])
# 시리즈를 다시 데이터 프레임으로 변환

        mean
0  55.000000
1  78.666667
2  53.333333
3  70.000000
4  75.000000

In [29]:
stu_score = pd.DataFrame(stu_mean.loc['mean'])

In [ ]:
# pd.select() 함수

# 조건 : 조건 변수를 정하고 리스트로 정리

In [33]:
score_lb = [
    stu_mean.loc['mean'] > 80,
    stu_mean.loc['mean'] > 70,
    stu_mean.loc['mean'] > 60
]

In [34]:
# 조건 결과 : 위 조건에 따른 결과를 순서대로 리스트로 정리

In [35]:
result = ['A','B','C']

In [42]:
np.select(score_lb, result, default='-')

array(['-', 'B', '-', 'C', 'B'], dtype='<U1')

In [43]:
# 배열로 나왔기 때문에 다시 데이터 프레임으로 바꿔서 출력